laura-bin/2021_microcontroleurs/LB_dsPIC33FJ32MC204_Filtres/src/main.c
/** ***************************************************************************
 * Dossier filtres
 * ===============
 * 
 * dsPIC33FJ32MC204
 * Proteus: dsPIC_Filtres (20MHz)
 * 
 * Microcontroleurs 2021 - Laura Binacchi
 ******************************************************************************/

// FBS
#pragma config BWRP = WRPROTECT_OFF     // Boot Segment Write Protect (Boot Segment may be written)
#pragma config BSS = NO_FLASH           // Boot Segment Program Flash Code Protection (No Boot program Flash segment)

// FGS
#pragma config GWRP = OFF               // General Code Segment Write Protect (User program memory is not write-protected)
#pragma config GSS = OFF                // General Segment Code Protection (User program memory is not code-protected)

// FOSCSEL
#pragma config FNOSC = PRI              // Oscillator Mode (Internal Fast RC (FRC) with divide by N)
#pragma config IESO = OFF               // Internal External Switch Over Mode (Start-up device with FRC, then automatically switch to user-selected oscillator source when ready)

// FOSC
#pragma config POSCMD = HS              // Primary Oscillator Source (Primary Oscillator Enabled)
#pragma config OSCIOFNC = OFF           // OSC2 Pin Function (OSC2 pin has clock out function)
#pragma config IOL1WAY = ON             // Peripheral Pin Select Configuration (Allow Only One Re-configuration)
#pragma config FCKSM = CSDCMD           // Clock Switching and Monitor (Both Clock Switching and Fail-Safe Clock Monitor are disabled)

// FWDT
#pragma config WDTPOST = PS32768        // Watchdog Timer Postscaler (1:32,768)
#pragma config WDTPRE = PR128           // WDT Prescaler (1:128)
#pragma config WINDIS = OFF             // Watchdog Timer Window (Watchdog Timer in Non-Window mode)
#pragma config FWDTEN = OFF             // Watchdog Timer Disabled

// FPOR
#pragma config FPWRT = PWR128           // POR Timer Value (128ms)
#pragma config ALTI2C = OFF             // Alternate I2C  pins (I2C mapped to SDA1/SCL1 pins)
#pragma config LPOL = ON                // Motor Control PWM Low Side Polarity bit (PWM module low side output pins have active-high output polarity)
#pragma config HPOL = ON                // Motor Control PWM High Side Polarity bit (PWM module high side output pins have active-high output polarity)
#pragma config PWMPIN = ON              // Motor Control PWM Module Pin Mode bit (PWM module pins controlled by PORT register at device Reset)

// FICD
#pragma config ICS = PGD1               // Comm Channel Select (Communicate on PGC1/EMUC1 and PGD1/EMUD1)
#pragma config JTAGEN = OFF             // JTAG Port Enable (JTAG is Disabled)

#include <xc.h>
#include <math.h>
#include <stdio.h>
#include "SPI.h"

#define COMP_VAL            64923       // Timer1 value -> 16Hz
#define COEF_SCALE          7       // filters coefficients scale: 2^7
#define TICK                LATCbits.LATC9  // debug tick measuring the processing time of the interruption

#define F_MOV_AVG           0       // moving average filter
#define F_LOW_PASS          1       // low-pass filter
#define F_HIGH_PASS         2       // high-pass filter
#define F_ECHO              3       // echo filter
#define F_COUNT             4       // count of filters

#define IN_BUF_SIZE         2000    // input signal buffer size
#define OUT_BUF_SIZE        1       // output signal buffer size

int sig_in[10];                     // input signal buffer
int sig_out[OUT_BUF_SIZE];          // output signal buffer
int buf_index;                      // input buffer index

// Global variables (used by the interruption & the main program)
// signed char sig_in[IN_BUF_SIZE];    
// signed char sig_out[OUT_BUF_SIZE];  
// int index[F_ECHO_N_MAX+1];          
// int coef[F_ECHO_N_MAX+1];           // coefficients used to compute the output signal
// char filter;                        // current filter selected
// int sampling;                       // sampling frequency (8 or 16 kHz)
// char mov_avg_coef;                  // moving average filter coefficient (1-3 -> 2, 4 or 8)
// int low_cutoff;                     // low-pass filter cutoff frequency
// int high_cutoff;                    // high-pass filter cutoff frequency
// int echo_delay;                     // echo filter delay
// int echoes;                         // echo filter number of echoes (1, 2 or 3)

// Display function
// void display_parameters(void);                  // display all the parameters
// void update_sampling_frequency(int new_val);    // update the sampling frequency and display it
// void update_mov_avg_coef(char new_val);         // update the moving average coefficient and display it
// void update_low_cutoff(int new_val);            // update the low cutoff frequency and display it
// void update_high_cutoff(int new_val);           // update the high cutoff frequency and display it
// void update_echo_delay(int new_val);            // update the echo delay and display it
// void update_echoes(int new_val);                // update the number of echoes and display it

// void __interrupt(high_priority) Int_Vect_High(void) {
//     int i;
//     long output;    // temporary variable used to compute the output signal value

//     TICK = 1;                       // debug tick ON

//     while (ADCON0bits.NOT_DONE);    // analog to digital conversion, result in the input buffer
//     sig_in[index[0]] = (signed char) (ADRESH - 128);

//     output = 0;
//     switch (filter) {
//     case F_MOV_AVG:                 // moving average filter: Yt = SUM(i=0:coef-1) Xt-i / coef
//         for (i = 0; i < 1<<mov_avg_coef; i++) output += sig_in[i];
//         output = output >> mov_avg_coef;
//         index[0]++;                     // increment the input buffer index
//         if (index[0] == 1<<mov_avg_coef) index[0] = 0;
//         break;
//     case F_LOW_PASS:                    // low-pass filter: Yt = A * (Xt + Xt-1) + B * Yt-1
//         output = coef[0]*(sig_in[0] + sig_in[1]) + coef[1]*sig_out[0];
//         output = output >> COEF_SCALE;
//         sig_in[1] = sig_in[0];             // shift the input signal value in the buffer
//         sig_out[0] = (signed char) output; // store the output value in the buffer
//         break;
//     case F_HIGH_PASS:                   // low-pass filter: Yt = A * (Xt - Xt-1) + B * Yt-1
//         output = coef[0]*(sig_in[0] - sig_in[1]) + coef[1]*sig_out[0];
//         output = output >> COEF_SCALE;
//         sig_in[1] = sig_in[0];             // shift the input signal value in the buffer
//         sig_out[0] = (signed char) output; // store the output value in the buffer
//         break;
//     case F_ECHO:                   // echo filter: Yt = A Xt + B Xt-delay + ...
//         for (i = 0; i <= echoes; i++) output += coef[i] * sig_in[index[i]];
//         output = output >> COEF_SCALE;
//         for (i = 0; i <= echoes; i++) {     // increment the input buffer indexes
//             index[i]++;
//             if (index[i] == IN_BUF_SIZE) index[i] = 0;
//         }
//         break;
//     default:
//         break;
//     }


