laura-bin/2021_microcontroleurs/LB_dsPIC33FJ32MC204_Filtres/src/main.c
 //    DAC0808 = (unsigned char) (output + 128);

//     TICK = 0;               // debug tick OFF
//     PIR2bits.CCP2IF = 0;    // interruption flag cleared
// }

void __attribute__((interrupt(auto_psv))) _T1Interrupt(void) {
    char high;
    TMR1 = COMP_VAL;
    TICK = 1;
    
    AD1CON1bits.SAMP = 1;
    AD1CON1bits.SAMP = 0;
    while(!AD1CON1bits.DONE);
    
    SPI_DAC_CS = 0;         // send the output signal value to the DAC
    SSPIF = 0;
    SPI1BUF = (ADC1BUF0 >> 8) | 0x30;         // MCP4922 mode x2
    while (!SSPIF);
    SSPIF = 0;
    SPI1BUF = ADC1BUF0;
    while (!SSPIF);
    SPI_DAC_CS = 1;
    LDAC = 0;               // load the DAC
    LDAC = 1;

    // DAC0808 = (unsigned char) (output + 128);
    
    // input buffer = ADC1BUF0;

    TICK = 0;
    _T1IF = 0;
}

void main(void) {
    // SPI configuration
    __builtin_write_OSCCONL(OSCCON & ~(1<<6));  // unlock registers
    RPINR20bits.SCK1R = 20;                     // SPI SDI
    RPOR10bits.RP21R = 7;                       // SPI SDO
    RPOR11bits.RP23R = 8;                       // SPI SCK
    __builtin_write_OSCCONL(OSCCON | (1<<6));   // lock registers
    init_SPI();

    // I/O configuration
    TRISAbits.TRISA0 = 1;                       // AN0 -> input
    TRISCbits.TRISC9 = 0;                       // TICK -> output
    TICK = 0;

    // ADC configuration
    AD1CON1bits.ADON = 0;                       // disable ADC
    AD1CON1bits.AD12B = 1;                      // 1 channel, 12 bits
    AD1CON3bits.SAMC = 4;                       // 4TAD
    AD1CON3bits.ADCS = 3;                       // 1TAD = 3TCY
    AD1PCFGLbits.PCFG0 = 0;                     // AN0 -> analog mode
    AD1CON1bits.ADON = 1;                       // enable ADC

    // Timer1 configuration
    T1CON = 0x8000;                             // Timer1 enabled, internal clock, prescale 1:1
    TMR1 = COMP_VAL;
    _T1IP = 7;                                  // Timer1 priority
    _T1IF = 0;                                  // Timer1 interrupt flag cleared
    
    
    
    // init LCD
    // send text to LCD
    // read parameters
    // init filter
    


    
    
    
    
    // Enable Timer1 interrupt
    _T1IE = 1;
    while (1);
    
// __builtin_write_OSCCONL
// Unlocks and writes its argument to OSCCONL.
// Interrupts may need to be disabled for proper operation.


//     int i;
//     char menu_entry;        // current menu entry selected
//     char prev_mode;         // previous mode selected: run, config or none
////     int cutoff_max;         // high/low pass filter max cutoff value determined by the sampling frequency
//     double omega;           // angular frequency used to initialize some filters coefficients
    // char text[20];

    // PIC configuration
//     TRISE   = 0xFF;         // PORTE (menu buttons) -> input
//     TRISGbits.TRISG0 = 0;   // TICK -> output
//     TICK    = 0;            // TICK -> 0
//     TRISD   = 0;            // DAC0808 -> output
//     DAC0808 = 128;          // DAC0808 -> 0 + offset
//     ADCON0  = 0X01;         // ADC enabled on AN0
//     ADCON1  = 0x0E;         // AN0 -> analogic
//     ADCON2  = 0x01;         // Left justification, 0 Tad, 8 Tosc
//     CCP2CON = 0x0B;         // CCP2 interruption in compare mode with trigger special event
//     CCPR2H  = 0x04;         // 1250us -> 8kHz
//     CCPR2L  = 0xE2;
//     T1CON   = 0x01;         // Timer1 prescale 1:1
//     TMR1H   = 0;            // Timer1 -> 0
//     TMR1L   = 0;
//     RCONbits.IPEN   = 1;    // enable priority levels on interrupts
//     INTCONbits.GIEH = 0;    // high priority interrupts disabled
//     INTCONbits.GIEL = 0;    // low priority interrupts disabled
//     IPR2bits.CCP2IP = 1;    // CCP2 interrupt: high priority
//     PIE2bits.CCP2IE = 1;    // CCP2 interrupt enabled
//     PIR2bits.CCP2IF = 0;    // CCP2 interrupt flag cleared
//     init_SPI();             // SPI bus and peripherals initialization

    // Parameters initialization
//     prev_mode       = MODE_NONE;            // previous mode selected: none
//     sampling        = (int) (10000 / ((CCPR2H << 8) + CCPR2L)); // sampling frequency determined by the CCP2 value
//     cutoff_max      = sampling*1000 >> 1;   // low/high pass filter max value determined by the sampling frequency
//     filter          = F_MOV_AVG;            // filter selected: moving average
//     mov_avg_coef    = F_MOV_AVG_MIN;        // moving average value: minimum
 //    low_cutoff      = F_LOW_PASS_MIN;       // low-pass cutoff value: minimum
//     high_cutoff     = cutoff_max;           // high-pass cutoff value: maximum
//     echo_delay      = F_ECHO_DEL_MIN;       // echo delay: minimum
//     echoes          = F_ECHO_N_MIN;         // number of echoes: minimum

    // Moving average filter test: coef 2-4-8 (16kHz)
    // filter          = F_MOV_AVG;
    // CCPR2H          = CCPR2H >> 1;
    // CCPR2L          = CCPR2L >> 1;
    // sampling        = sampling << 1;
    // mov_avg_coef    = 1;
    // mov_avg_coef    = 2;
    // mov_avg_coef    = 3;

    // Moving average filter test: coef 2-4-8 (8kHz)
    // filter          = F_MOV_AVG;
    // mov_avg_coef    = 1;
    // mov_avg_coef    = 2;
    // mov_avg_coef    = 3;

    // Low-pass filter test (16kHz)
    // filter          = F_LOW_PASS;
    // CCPR2H          = CCPR2H >> 1;
    // CCPR2L          = CCPR2L >> 1;
    // sampling        = sampling << 1;
    // low_cutoff      = 0;
    // low_cutoff      = 500;
    // low_cutoff      = 1000;
    // low_cutoff      = 2000;
    // low_cutoff      = 4000;
    // low_cutoff      = 8000;

    // Low-pass filter test (8kHz)
    // filter          = F_LOW_PASS;
    // low_cutoff      = 0;
    // low_cutoff      = 250;
    // low_cutoff      = 500;
    // low_cutoff      = 1000;
    // low_cutoff      = 2000;
    // low_cutoff      = 4000;

    // High-pass filter test (16kHz)
    // filter          = F_HIGH_PASS;
    // CCPR2H          = CCPR2H >> 1;
    // CCPR2L          = CCPR2L >> 1;
    // sampling        = sampling << 1;
    // high_cutoff     = 0;
    // high_cutoff     = 500;
    // high_cutoff     = 1000;
    // high_cutoff     = 2000;
    // high_cutoff     = 4000;
    // high_cutoff     = 8000;

    // High-pass filter test (8kHz)
    // filter          = F_HIGH_PASS;
    // high_cutoff     = 0;
    // high_cutoff     = 250;
    // high_cutoff     = 500;
    // high_cutoff     = 1000;
    // high_cutoff     = 2000;
    // high_cutoff     = 4000;

