laura-bin/2021_microcontroleurs/LB_dsPIC33FJ32MC204_Filtres/src/main.c
    // Echo filter test: 1 echo, delay 200ms (16kHz)
    // filter          = F_ECHO;
    // CCPR2H          = CCPR2H >> 1;
    // CCPR2L          = CCPR2L >> 1;
    // sampling        = sampling << 1;
    // echo_delay      = F_ECHO_DEL_MAX;
    // echoes          = F_ECHO_N_MIN;

    // Echo filter test: 1 echo, delay 400-200-100ms (8kHz)
    // filter          = F_ECHO;
    // echoes          = F_ECHO_N_MIN;
    // echo_delay      = F_ECHO_DEL_MAX;
    // echo_delay      = F_ECHO_DEL_MAX>>1;
    // echo_delay      = F_ECHO_DEL_MAX>>2;

    // Echo filter test: 2 echoes, delay 400ms (8kHz)
    // filter          = F_ECHO;
    // echoes          = 2;
    // echo_delay      = F_ECHO_DEL_MAX;

    // Echo filter test: 3 echoes, delay 400ms (8kHz)
    // filter          = F_ECHO;
    // echoes          = F_ECHO_N_MAX;
    // echo_delay      = F_ECHO_DEL_MAX;

//     display_parameters();

    // Main loop: polling on the RUN/CONFIG switch
//     while (1) {
//         if (SW_RUN) {
//             if (prev_mode != MODE_RUN) {            // run mode initialization:
//                 prev_mode = MODE_RUN;                       // set the previous mode to RUN
//                 send_text_LCD(" ", menu_entry, SELECT_POS); // erase the menu selector

//                 index[0] = 0;                               // input buffer index to 0
//                 for (i = 0; i < IN_BUF_SIZE; i++) sig_in[i] = 0;    // input buffer to 0
//                 for (i = 0; i < OUT_BUF_SIZE; i++) sig_out[i] = 0;  // output buffer to 0

//                 switch (filter) {                   // depending on the filter selected:
//                 case F_LOW_PASS:                        // compute the low-pass filter coefficients
//                     omega = 2.0 * M_PI * (double) low_cutoff / (double) sampling / 1000.0;
//                     coef[0] = (int) round(omega / (2.0 + omega) * pow(2.0, COEF_SCALE));
//                     coef[1] = (int) round((2.0 - omega) / (2.0 + omega) * pow(2.0, COEF_SCALE));
                    // sprintf(text, "%4d %4d", coef[0], coef[1]);
                    // send_text_LCD(text, 3, 0);
//                     break;
//                 case F_HIGH_PASS:                       // or compute the low-pass filter coefficients
//                     omega = 2.0 * M_PI * (double)high_cutoff / (double)sampling / 1000.0;
//                     coef[0] = (int) round(2.0 / (2.0 + omega) * pow(2.0, COEF_SCALE));
//                     coef[1] = (int) round((2.0 - omega) / (2.0 + omega) * pow(2.0, COEF_SCALE));
                    // sprintf(text, "%4d %4d", coef[0], coef[1]);
                    // send_text_LCD(text, 3, 0);
//                     break;
//                 case F_ECHO:                            // or initialize the echoes indexes
//                     for (i = 0; i < echoes; i++) index[echoes-i] = IN_BUF_SIZE - echo_delay/(i+1);
//                     switch (echoes) {                   // and the echoes coefficients (total must be 128, 2^COEF_SCALE)
//                     case 1:
//                         coef[0] = 96;   // original signal
//                         coef[1] = 32;   // echo
//                         break;
//                     case 2:
//                         coef[0] = 64;   // original signal
//                         coef[1] = 40;   // first echo
//                         coef[2] = 24;    // second echo
//                         break;
//                     case 3:
//                         coef[0] = 44;   // original signal
//                         coef[1] = 36;   // first echo
//                         coef[2] = 28;   // second echo
//                         coef[3] = 20;    // third echo
//                         break;
//                     default:
//                         break;
//                     }
//                     break;
//                 default:                            // other filters does not need a specific initialization
//                     break;
//                 }
//                 INTCONbits.GIEH = 1;                // enable high priority interrupts
//             }
//         } else {
//             if (prev_mode != MODE_CONFIG) {         // config mode initialization: 
//                 INTCONbits.GIEH = 0;                        // disable high priority interrupts
//                 prev_mode = MODE_CONFIG;                    // set the previous mode to CONFIG
//                 menu_entry = M_FILTER;                      // select the first menu
//                 send_text_LCD("<", menu_entry, SELECT_POS); // display the menu selector
//             }
// 
//             if (!PB_PREV_MENU) {                        // previous menu selection:
//                 while (!PB_PREV_MENU);                      // wait the button release
//                 send_text_LCD(" ", menu_entry, SELECT_POS); // erase the menu selector
//                 if (!menu_entry) menu_entry = filter == F_ECHO ? M_ECHO_COUNT-1 : M_COUNT-1;
//                 else menu_entry--;                          // select the previous menu
//                 send_text_LCD("<", menu_entry, SELECT_POS); // display the menu selector
// 
//  } else if (!PB_NEXT_MENU) {                 // next menu selection:
//                 while (!PB_NEXT_MENU);                      // wait the button release
//                 send_text_LCD(" ", menu_entry, SELECT_POS); // erase the menu selector
//                 if (filter == F_ECHO && menu_entry == M_ECHO_COUNT-1) menu_entry = 0;
//                 else if (filter != F_ECHO && menu_entry == M_COUNT-1) menu_entry = 0;
//                 else menu_entry++;                          // select the next menu
//                 send_text_LCD("<", menu_entry, SELECT_POS); // display the menu selector

//             } else if (!PB_VALUE_DN) {  // value down selection:
//                 while (!PB_VALUE_DN);       // wait the button release
//                 switch (menu_entry) {
//                 case M_FILTER:              // select the previous filter type
//                     if (!filter) filter = F_COUNT-1;
//                     else filter--;
//                     display_parameters();
//                     break;
//                 case M_SAMPLING:            // decrease the sampling frequency
//                     if (sampling == SAMPLING_MAX) {
//                         CCPR2H = (unsigned char) (CCPR2H << 1);
//                         CCPR2L = (unsigned char) (CCPR2L << 1);
//                         update_sampling_frequency(sampling >> 1);
//                         cutoff_max = sampling*1000 >> 1;
//                         update_echo_delay(echo_delay);
//                         if (low_cutoff > cutoff_max) update_low_cutoff(cutoff_max);
//                         if (high_cutoff > cutoff_max) update_high_cutoff(cutoff_max);
//                     }
//                     break;
//                 case M_VALUE:               // decrease the filter first value, either
//                     switch (filter) {
//                     case F_MOV_AVG:             // the moving average value
//                         if (mov_avg_coef > F_MOV_AVG_MIN) update_mov_avg_coef(mov_avg_coef-F_MOV_AVG_COEF_STEP);
//                         break;
//                     case F_LOW_PASS:            // the low-pass filter cutoff frequency
//                         if (low_cutoff > F_LOW_PASS_MIN) update_low_cutoff(low_cutoff-F_HL_PASS_STEP);
//                         break;
//                     case F_HIGH_PASS:           // the high-pass filter cutoff frequency
//                         if (high_cutoff > F_HIGH_PASS_MIN) update_high_cutoff(high_cutoff-F_HL_PASS_STEP);
//                         break;
//                     case F_ECHO:                // the delay of the echo filter
//                         if (echo_delay > F_ECHO_DEL_MIN) update_echo_delay(echo_delay-F_ECHO_DEL_STEP);
//                         break;
//                     default:
//                         break;
//                     }
//                     break;
//                 case M_VALUE2:              // decrease the filter second value (the number of echoes)
//                     if (echoes > F_ECHO_N_MIN) update_echoes(echoes-1);
//                     break;
//                 default:
//                     break;
//                 }
// 
//             } else if (!PB_VALUE_UP) {  // value up selection:
//                 while (!PB_VALUE_UP);       // wait the button release
//                 switch (menu_entry) {
//                 case M_FILTER:              // select the next filter type
//                     if (filter == F_COUNT-1) filter = 0;
//                     else filter++;
//                     display_parameters();
//                     break;
//                 case M_SAMPLING:            // increase the sampling frequency
//                     if (sampling == SAMPLING_MIN) {
//                         CCPR2H = CCPR2H >> 1;
// //                         CCPR2L = CCPR2L >> 1;
//                         update_sampling_frequency(sampling << 1);
//                         cutoff_max = sampling*1000 >> 1;
//                         update_echo_delay(echo_delay);
//                     }
//                     break;
//                 case M_VALUE:               // increase the filter first value, either
//                     switch (filter) {
//                     case F_MOV_AVG:             // the moving average value
//                         if (mov_avg_coef < F_MOV_AVG_MAX) update_mov_avg_coef(mov_avg_coef+F_MOV_AVG_COEF_STEP);
//                         break;
//                     case F_LOW_PASS:            // the low-pass filter cutoff frequency
//                         if (low_cutoff < cutoff_max) update_low_cutoff(low_cutoff+F_HL_PASS_STEP);
//                         break;
//                     case F_HIGH_PASS:           // the high-pass filter cutoff frequency
//                         if (high_cutoff < cutoff_max) update_high_cutoff(high_cutoff+F_HL_PASS_STEP);
//                         break;
//                     case F_ECHO:                // the delay of the echo filter
//                         if (echo_delay < F_ECHO_DEL_MAX) update_echo_delay(echo_delay+F_ECHO_DEL_STEP);
//                         break;
//                     default:
//                         break;
//                     }
//                     break;
//                 case M_VALUE2:              // increase the filter second value (the number of echoes)
// //                     if (echoes < F_ECHO_N_MAX) update_echoes(echoes+1);
//                     break;
//                 default:
//                     break;
//                 }
//             }
//         }
//         __delay_ms(100);
//     }
}

