laura-bin/2021_microcontroleurs/LB_dsPIC33FJ32MC204_Filtres/src/main.c
// void display_parameters() {
//     char text[19];
//     switch (filter) {
// //     case F_MOV_AVG:
//         send_text_LCD("Moving avg filter ", M_FILTER, 0);
//         sprintf(text, "Sampling %6d Hz", sampling*1000);
//         send_text_LCD(text, M_SAMPLING, 0);
//         sprintf(text, "Steps       %6d", 1 << mov_avg_coef);
//         send_text_LCD(text, M_VALUE, 0);
//         send_text_LCD("                  ", M_VALUE2, 0);
//         break;
//     case F_LOW_PASS:
//         send_text_LCD("Low-pass filter   ", M_FILTER, 0);
//         sprintf(text, "Sampling %6d Hz", sampling*1000);
//         send_text_LCD(text, M_SAMPLING, 0);
//         sprintf(text, "Cutoff %8u Hz", low_cutoff);
//         send_text_LCD(text, M_VALUE, 0);
//         send_text_LCD("                  ", M_VALUE2, 0);
//         break;
//     case F_HIGH_PASS:
//         send_text_LCD("High-pass filter  ", M_FILTER, 0);
// //         sprintf(text, "Sampling %6d Hz", sampling*1000);
//         send_text_LCD(text, M_SAMPLING, 0);
//         sprintf(text, "Cutoff %8u Hz", high_cutoff);
//         send_text_LCD(text, M_VALUE, 0);
//         send_text_LCD("                  ", M_VALUE2, 0);
//         break;
//     case F_ECHO:
//         send_text_LCD("Echo filter       ", M_FILTER, 0);
//         sprintf(text, "Sampling %6d Hz", sampling*1000);
//         send_text_LCD(text, M_SAMPLING, 0);
// //         sprintf(text, "Delay %9d ms", echo_delay / sampling);
//         send_text_LCD(text, M_VALUE, 0);
//         sprintf(text, "Echoes %11d", echoes);
//         send_text_LCD(text, M_VALUE2, 0);
//         break;
//     default:
//         break;
//     }
// }

// void update_sampling_frequency(int new_val) {
//     char text[19];
//     sampling = new_val;
//     sprintf(text, "%6d", sampling*1000);
//     send_text_LCD(text, M_SAMPLING, 9);
// }

// void update_mov_avg_coef(char new_val) {
//     char text[19];
//     mov_avg_coef = new_val;
//     if (filter == F_MOV_AVG) {
//         sprintf(text, "%6d", 1 << mov_avg_coef);
//         send_text_LCD(text, M_VALUE, 12);
//     }
// }

// void update_low_cutoff(int new_val) {
//     char text[19];
//     low_cutoff = new_val;
//     if (filter == F_LOW_PASS) {
//         sprintf(text, "%8u", low_cutoff);
//         send_text_LCD(text, M_VALUE, 7);
//     }
// }
// 
// void update_high_cutoff(int new_val) {
//     char text[19];
//     high_cutoff = new_val;
//     if (filter == F_HIGH_PASS) {
//         sprintf(text, "%8u", high_cutoff);
//         send_text_LCD(text, M_VALUE, 7);
//     }
// }
// 
// void update_echo_delay(int new_val) {
//     char text[19];
//     echo_delay = new_val;
//     if (filter == F_ECHO) {
//         sprintf(text, "%9d", echo_delay / sampling);
//         send_text_LCD(text, M_VALUE, 6);
//     }
// }

// void update_echoes(int new_val) {
//     char text[19];
//     echoes = new_val;
//     if (filter == F_ECHO) {
// //         sprintf(text, "%11d", echoes);
//         send_text_LCD(text, M_VALUE2, 7);
 //    }
// }
